GopalSaraf/Practicals/PSDL/include/proc/pic18f25k22.inc
// Register: PR4
#define PR4 PR4
PR4                                      equ 0F52h
// bitfield definitions
PR4_PR4_POSN                             equ 0000h
PR4_PR4_POSITION                         equ 0000h
PR4_PR4_SIZE                             equ 0008h
PR4_PR4_LENGTH                           equ 0008h
PR4_PR4_MASK                             equ 00FFh

// Register: TMR4
#define TMR4 TMR4
TMR4                                     equ 0F53h
// bitfield definitions
TMR4_TMR4_POSN                           equ 0000h
TMR4_TMR4_POSITION                       equ 0000h
TMR4_TMR4_SIZE                           equ 0008h
TMR4_TMR4_LENGTH                         equ 0008h
TMR4_TMR4_MASK                           equ 00FFh

// Register: CCP5CON
#define CCP5CON CCP5CON
CCP5CON                                  equ 0F54h
// bitfield definitions
CCP5CON_CCP5M_POSN                       equ 0000h
CCP5CON_CCP5M_POSITION                   equ 0000h
CCP5CON_CCP5M_SIZE                       equ 0004h
CCP5CON_CCP5M_LENGTH                     equ 0004h
CCP5CON_CCP5M_MASK                       equ 000Fh
CCP5CON_DC5B_POSN                        equ 0004h
CCP5CON_DC5B_POSITION                    equ 0004h
CCP5CON_DC5B_SIZE                        equ 0002h
CCP5CON_DC5B_LENGTH                      equ 0002h
CCP5CON_DC5B_MASK                        equ 0030h
CCP5CON_CCP5M0_POSN                      equ 0000h
CCP5CON_CCP5M0_POSITION                  equ 0000h
CCP5CON_CCP5M0_SIZE                      equ 0001h
CCP5CON_CCP5M0_LENGTH                    equ 0001h
CCP5CON_CCP5M0_MASK                      equ 0001h
CCP5CON_CCP5M1_POSN                      equ 0001h
CCP5CON_CCP5M1_POSITION                  equ 0001h
CCP5CON_CCP5M1_SIZE                      equ 0001h
CCP5CON_CCP5M1_LENGTH                    equ 0001h
CCP5CON_CCP5M1_MASK                      equ 0002h
CCP5CON_CCP5M2_POSN                      equ 0002h
CCP5CON_CCP5M2_POSITION                  equ 0002h
CCP5CON_CCP5M2_SIZE                      equ 0001h
CCP5CON_CCP5M2_LENGTH                    equ 0001h
CCP5CON_CCP5M2_MASK                      equ 0004h
CCP5CON_CCP5M3_POSN                      equ 0003h
CCP5CON_CCP5M3_POSITION                  equ 0003h
CCP5CON_CCP5M3_SIZE                      equ 0001h
CCP5CON_CCP5M3_LENGTH                    equ 0001h
CCP5CON_CCP5M3_MASK                      equ 0008h
CCP5CON_DC5B0_POSN                       equ 0004h
CCP5CON_DC5B0_POSITION                   equ 0004h
CCP5CON_DC5B0_SIZE                       equ 0001h
CCP5CON_DC5B0_LENGTH                     equ 0001h
CCP5CON_DC5B0_MASK                       equ 0010h
CCP5CON_DC5B1_POSN                       equ 0005h
CCP5CON_DC5B1_POSITION                   equ 0005h
CCP5CON_DC5B1_SIZE                       equ 0001h
CCP5CON_DC5B1_LENGTH                     equ 0001h
CCP5CON_DC5B1_MASK                       equ 0020h

// Register: CCPR5
#define CCPR5 CCPR5
CCPR5                                    equ 0F55h

// Register: CCPR5L
#define CCPR5L CCPR5L
CCPR5L                                   equ 0F55h
// bitfield definitions
CCPR5L_CCPR5L_POSN                       equ 0000h
CCPR5L_CCPR5L_POSITION                   equ 0000h
CCPR5L_CCPR5L_SIZE                       equ 0008h
CCPR5L_CCPR5L_LENGTH                     equ 0008h
CCPR5L_CCPR5L_MASK                       equ 00FFh

// Register: CCPR5H
#define CCPR5H CCPR5H
CCPR5H                                   equ 0F56h
// bitfield definitions
CCPR5H_CCPR5H_POSN                       equ 0000h
CCPR5H_CCPR5H_POSITION                   equ 0000h
CCPR5H_CCPR5H_SIZE                       equ 0008h
CCPR5H_CCPR5H_LENGTH                     equ 0008h
CCPR5H_CCPR5H_MASK                       equ 00FFh

// Register: CCP4CON
#define CCP4CON CCP4CON
CCP4CON                                  equ 0F57h
// bitfield definitions
CCP4CON_CCP4M_POSN                       equ 0000h
CCP4CON_CCP4M_POSITION                   equ 0000h
CCP4CON_CCP4M_SIZE                       equ 0004h
CCP4CON_CCP4M_LENGTH                     equ 0004h
CCP4CON_CCP4M_MASK                       equ 000Fh
CCP4CON_DC4B_POSN                        equ 0004h
CCP4CON_DC4B_POSITION                    equ 0004h
CCP4CON_DC4B_SIZE                        equ 0002h
CCP4CON_DC4B_LENGTH                      equ 0002h
CCP4CON_DC4B_MASK                        equ 0030h
CCP4CON_CCP4M0_POSN                      equ 0000h
CCP4CON_CCP4M0_POSITION                  equ 0000h
CCP4CON_CCP4M0_SIZE                      equ 0001h
CCP4CON_CCP4M0_LENGTH                    equ 0001h
CCP4CON_CCP4M0_MASK                      equ 0001h
CCP4CON_CCP4M1_POSN                      equ 0001h
CCP4CON_CCP4M1_POSITION                  equ 0001h
CCP4CON_CCP4M1_SIZE                      equ 0001h
CCP4CON_CCP4M1_LENGTH                    equ 0001h
CCP4CON_CCP4M1_MASK                      equ 0002h
CCP4CON_CCP4M2_POSN                      equ 0002h
CCP4CON_CCP4M2_POSITION                  equ 0002h
CCP4CON_CCP4M2_SIZE                      equ 0001h
CCP4CON_CCP4M2_LENGTH                    equ 0001h
CCP4CON_CCP4M2_MASK                      equ 0004h
CCP4CON_CCP4M3_POSN                      equ 0003h
CCP4CON_CCP4M3_POSITION                  equ 0003h
CCP4CON_CCP4M3_SIZE                      equ 0001h
CCP4CON_CCP4M3_LENGTH                    equ 0001h
CCP4CON_CCP4M3_MASK                      equ 0008h
CCP4CON_DC4B0_POSN                       equ 0004h
CCP4CON_DC4B0_POSITION                   equ 0004h
CCP4CON_DC4B0_SIZE                       equ 0001h
CCP4CON_DC4B0_LENGTH                     equ 0001h
CCP4CON_DC4B0_MASK                       equ 0010h
CCP4CON_DC4B1_POSN                       equ 0005h
CCP4CON_DC4B1_POSITION                   equ 0005h
CCP4CON_DC4B1_SIZE                       equ 0001h
CCP4CON_DC4B1_LENGTH                     equ 0001h
CCP4CON_DC4B1_MASK                       equ 0020h

// Register: CCPR4
#define CCPR4 CCPR4
CCPR4                                    equ 0F58h

// Register: CCPR4L
#define CCPR4L CCPR4L
CCPR4L                                   equ 0F58h
// bitfield definitions
CCPR4L_CCPR4L_POSN                       equ 0000h
CCPR4L_CCPR4L_POSITION                   equ 0000h
CCPR4L_CCPR4L_SIZE                       equ 0008h
CCPR4L_CCPR4L_LENGTH                     equ 0008h
CCPR4L_CCPR4L_MASK                       equ 00FFh

// Register: CCPR4H
#define CCPR4H CCPR4H
CCPR4H                                   equ 0F59h
// bitfield definitions
CCPR4H_CCPR4H_POSN                       equ 0000h
CCPR4H_CCPR4H_POSITION                   equ 0000h
CCPR4H_CCPR4H_SIZE                       equ 0008h
CCPR4H_CCPR4H_LENGTH                     equ 0008h
CCPR4H_CCPR4H_MASK                       equ 00FFh

// Register: PSTR3CON
#define PSTR3CON PSTR3CON
PSTR3CON                                 equ 0F5Ah
// bitfield definitions
PSTR3CON_STR3A_POSN                      equ 0000h
PSTR3CON_STR3A_POSITION                  equ 0000h
PSTR3CON_STR3A_SIZE                      equ 0001h
PSTR3CON_STR3A_LENGTH                    equ 0001h
PSTR3CON_STR3A_MASK                      equ 0001h
PSTR3CON_STR3B_POSN                      equ 0001h
PSTR3CON_STR3B_POSITION                  equ 0001h
PSTR3CON_STR3B_SIZE                      equ 0001h
PSTR3CON_STR3B_LENGTH                    equ 0001h
PSTR3CON_STR3B_MASK                      equ 0002h
PSTR3CON_STR3C_POSN                      equ 0002h
PSTR3CON_STR3C_POSITION                  equ 0002h
PSTR3CON_STR3C_SIZE                      equ 0001h
PSTR3CON_STR3C_LENGTH                    equ 0001h
PSTR3CON_STR3C_MASK                      equ 0004h
PSTR3CON_STR3D_POSN                      equ 0003h
PSTR3CON_STR3D_POSITION                  equ 0003h
PSTR3CON_STR3D_SIZE                      equ 0001h
PSTR3CON_STR3D_LENGTH                    equ 0001h
PSTR3CON_STR3D_MASK                      equ 0008h
PSTR3CON_STR3SYNC_POSN                   equ 0004h
PSTR3CON_STR3SYNC_POSITION               equ 0004h
PSTR3CON_STR3SYNC_SIZE                   equ 0001h
PSTR3CON_STR3SYNC_LENGTH                 equ 0001h
PSTR3CON_STR3SYNC_MASK                   equ 0010h
PSTR3CON_STRA3_POSN                      equ 0000h
PSTR3CON_STRA3_POSITION                  equ 0000h
PSTR3CON_STRA3_SIZE                      equ 0001h
PSTR3CON_STRA3_LENGTH                    equ 0001h
PSTR3CON_STRA3_MASK                      equ 0001h
PSTR3CON_STRB3_POSN                      equ 0001h
PSTR3CON_STRB3_POSITION                  equ 0001h
PSTR3CON_STRB3_SIZE                      equ 0001h
PSTR3CON_STRB3_LENGTH                    equ 0001h
PSTR3CON_STRB3_MASK                      equ 0002h
PSTR3CON_STRC3_POSN                      equ 0002h
PSTR3CON_STRC3_POSITION                  equ 0002h
PSTR3CON_STRC3_SIZE                      equ 0001h
PSTR3CON_STRC3_LENGTH                    equ 0001h
PSTR3CON_STRC3_MASK                      equ 0004h
PSTR3CON_STRD3_POSN                      equ 0003h
PSTR3CON_STRD3_POSITION                  equ 0003h
PSTR3CON_STRD3_SIZE                      equ 0001h
PSTR3CON_STRD3_LENGTH                    equ 0001h
PSTR3CON_STRD3_MASK                      equ 0008h
PSTR3CON_STRSYNC3_POSN                   equ 0004h
PSTR3CON_STRSYNC3_POSITION               equ 0004h
PSTR3CON_STRSYNC3_SIZE                   equ 0001h
PSTR3CON_STRSYNC3_LENGTH                 equ 0001h
PSTR3CON_STRSYNC3_MASK                   equ 0010h

// Register: ECCP3AS
#define ECCP3AS ECCP3AS
ECCP3AS                                  equ 0F5Bh
// bitfield definitions
ECCP3AS_P3SSBD_POSN                      equ 0000h
ECCP3AS_P3SSBD_POSITION                  equ 0000h
ECCP3AS_P3SSBD_SIZE                      equ 0002h
ECCP3AS_P3SSBD_LENGTH                    equ 0002h
ECCP3AS_P3SSBD_MASK                      equ 0003h
ECCP3AS_P3SSAC_POSN                      equ 0002h
ECCP3AS_P3SSAC_POSITION                  equ 0002h
ECCP3AS_P3SSAC_SIZE                      equ 0002h
ECCP3AS_P3SSAC_LENGTH                    equ 0002h
ECCP3AS_P3SSAC_MASK                      equ 000Ch
ECCP3AS_CCP3AS_POSN                      equ 0004h
ECCP3AS_CCP3AS_POSITION                  equ 0004h
ECCP3AS_CCP3AS_SIZE                      equ 0003h
ECCP3AS_CCP3AS_LENGTH                    equ 0003h
ECCP3AS_CCP3AS_MASK                      equ 0070h
ECCP3AS_CCP3ASE_POSN                     equ 0007h
ECCP3AS_CCP3ASE_POSITION                 equ 0007h
ECCP3AS_CCP3ASE_SIZE                     equ 0001h
ECCP3AS_CCP3ASE_LENGTH                   equ 0001h
ECCP3AS_CCP3ASE_MASK                     equ 0080h
ECCP3AS_P3SSBD0_POSN                     equ 0000h
ECCP3AS_P3SSBD0_POSITION                 equ 0000h
ECCP3AS_P3SSBD0_SIZE                     equ 0001h
ECCP3AS_P3SSBD0_LENGTH                   equ 0001h
ECCP3AS_P3SSBD0_MASK                     equ 0001h
ECCP3AS_P3SSBD1_POSN                     equ 0001h
ECCP3AS_P3SSBD1_POSITION                 equ 0001h
ECCP3AS_P3SSBD1_SIZE                     equ 0001h
ECCP3AS_P3SSBD1_LENGTH                   equ 0001h
ECCP3AS_P3SSBD1_MASK                     equ 0002h
ECCP3AS_P3SSAC0_POSN                     equ 0002h
ECCP3AS_P3SSAC0_POSITION                 equ 0002h
ECCP3AS_P3SSAC0_SIZE                     equ 0001h
ECCP3AS_P3SSAC0_LENGTH                   equ 0001h
ECCP3AS_P3SSAC0_MASK                     equ 0004h
ECCP3AS_P3SSAC1_POSN                     equ 0003h
ECCP3AS_P3SSAC1_POSITION                 equ 0003h
ECCP3AS_P3SSAC1_SIZE                     equ 0001h
ECCP3AS_P3SSAC1_LENGTH                   equ 0001h
ECCP3AS_P3SSAC1_MASK                     equ 0008h
ECCP3AS_CCP3AS0_POSN                     equ 0004h
ECCP3AS_CCP3AS0_POSITION                 equ 0004h
ECCP3AS_CCP3AS0_SIZE                     equ 0001h
ECCP3AS_CCP3AS0_LENGTH                   equ 0001h
ECCP3AS_CCP3AS0_MASK                     equ 0010h
ECCP3AS_CCP3AS1_POSN                     equ 0005h
ECCP3AS_CCP3AS1_POSITION                 equ 0005h
ECCP3AS_CCP3AS1_SIZE                     equ 0001h
ECCP3AS_CCP3AS1_LENGTH                   equ 0001h
ECCP3AS_CCP3AS1_MASK                     equ 0020h
ECCP3AS_CCP3AS2_POSN                     equ 0006h
ECCP3AS_CCP3AS2_POSITION                 equ 0006h
ECCP3AS_CCP3AS2_SIZE                     equ 0001h
ECCP3AS_CCP3AS2_LENGTH                   equ 0001h
ECCP3AS_CCP3AS2_MASK                     equ 0040h
ECCP3AS_PSS3BD_POSN                      equ 0000h
ECCP3AS_PSS3BD_POSITION                  equ 0000h
ECCP3AS_PSS3BD_SIZE                      equ 0002h
ECCP3AS_PSS3BD_LENGTH                    equ 0002h
ECCP3AS_PSS3BD_MASK                      equ 0003h
ECCP3AS_PSS3AC_POSN                      equ 0002h
ECCP3AS_PSS3AC_POSITION                  equ 0002h
ECCP3AS_PSS3AC_SIZE                      equ 0002h
ECCP3AS_PSS3AC_LENGTH                    equ 0002h
ECCP3AS_PSS3AC_MASK                      equ 000Ch
ECCP3AS_PSS3BD0_POSN                     equ 0000h
ECCP3AS_PSS3BD0_POSITION                 equ 0000h
ECCP3AS_PSS3BD0_SIZE                     equ 0001h
ECCP3AS_PSS3BD0_LENGTH                   equ 0001h
ECCP3AS_PSS3BD0_MASK                     equ 0001h
ECCP3AS_PSS3BD1_POSN                     equ 0001h
ECCP3AS_PSS3BD1_POSITION                 equ 0001h
ECCP3AS_PSS3BD1_SIZE                     equ 0001h
ECCP3AS_PSS3BD1_LENGTH                   equ 0001h
ECCP3AS_PSS3BD1_MASK                     equ 0002h
ECCP3AS_PSS3AC0_POSN                     equ 0002h
ECCP3AS_PSS3AC0_POSITION                 equ 0002h
ECCP3AS_PSS3AC0_SIZE                     equ 0001h
ECCP3AS_PSS3AC0_LENGTH                   equ 0001h
ECCP3AS_PSS3AC0_MASK                     equ 0004h
ECCP3AS_PSS3AC1_POSN                     equ 0003h
ECCP3AS_PSS3AC1_POSITION                 equ 0003h
ECCP3AS_PSS3AC1_SIZE                     equ 0001h
ECCP3AS_PSS3AC1_LENGTH                   equ 0001h
ECCP3AS_PSS3AC1_MASK                     equ 0008h

// Register: PWM3CON
#define PWM3CON PWM3CON
PWM3CON                                  equ 0F5Ch
// bitfield definitions
PWM3CON_P3DC_POSN                        equ 0000h
PWM3CON_P3DC_POSITION                    equ 0000h
PWM3CON_P3DC_SIZE                        equ 0007h
PWM3CON_P3DC_LENGTH                      equ 0007h
PWM3CON_P3DC_MASK                        equ 007Fh
PWM3CON_P3RSEN_POSN                      equ 0007h
PWM3CON_P3RSEN_POSITION                  equ 0007h
PWM3CON_P3RSEN_SIZE                      equ 0001h
PWM3CON_P3RSEN_LENGTH                    equ 0001h
PWM3CON_P3RSEN_MASK                      equ 0080h
PWM3CON_P3DC0_POSN                       equ 0000h
PWM3CON_P3DC0_POSITION                   equ 0000h
PWM3CON_P3DC0_SIZE                       equ 0001h
PWM3CON_P3DC0_LENGTH                     equ 0001h
PWM3CON_P3DC0_MASK                       equ 0001h
PWM3CON_P3DC1_POSN                       equ 0001h
PWM3CON_P3DC1_POSITION                   equ 0001h
PWM3CON_P3DC1_SIZE                       equ 0001h
PWM3CON_P3DC1_LENGTH                     equ 0001h
PWM3CON_P3DC1_MASK                       equ 0002h
PWM3CON_P3DC2_POSN                       equ 0002h
PWM3CON_P3DC2_POSITION                   equ 0002h
PWM3CON_P3DC2_SIZE                       equ 0001h
PWM3CON_P3DC2_LENGTH                     equ 0001h
PWM3CON_P3DC2_MASK                       equ 0004h
PWM3CON_P3DC3_POSN                       equ 0003h
PWM3CON_P3DC3_POSITION                   equ 0003h
PWM3CON_P3DC3_SIZE                       equ 0001h
PWM3CON_P3DC3_LENGTH                     equ 0001h
PWM3CON_P3DC3_MASK                       equ 0008h
PWM3CON_P3DC4_POSN                       equ 0004h
PWM3CON_P3DC4_POSITION                   equ 0004h
PWM3CON_P3DC4_SIZE                       equ 0001h
PWM3CON_P3DC4_LENGTH                     equ 0001h
PWM3CON_P3DC4_MASK                       equ 0010h
PWM3CON_P3DC5_POSN                       equ 0005h
PWM3CON_P3DC5_POSITION                   equ 0005h
PWM3CON_P3DC5_SIZE                       equ 0001h
PWM3CON_P3DC5_LENGTH                     equ 0001h
PWM3CON_P3DC5_MASK                       equ 0020h
PWM3CON_P3DC6_POSN                       equ 0006h
PWM3CON_P3DC6_POSITION                   equ 0006h
PWM3CON_P3DC6_SIZE                       equ 0001h
PWM3CON_P3DC6_LENGTH                     equ 0001h
PWM3CON_P3DC6_MASK                       equ 0040h

